Revit 2027 API
FamilyType.AsElementId Method
Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AsElementId(
	FamilyParameter familyParameter
)
Public Function AsElementId (
	familyParameter As FamilyParameter
) As ElementId
public:
ElementId^ AsElementId(
	FamilyParameter^ familyParameter
)
member AsElementId :
        familyParameter : FamilyParameter -> ElementId
Parameters
familyParameter FamilyParameter
Return Value
ElementId
The Autodesk::Revit::DB::ElementId^ contained in the parameter.Returns an invalid element id if the storage type of the input argument is Autodesk::Revit::DB::ElementId^ type or this parameter has no value.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid,
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace